.planning/case_profiles/case_032_v65_flat_plate_2nd_witness_dicts/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         3000;
deltaT          1;
writeControl    timeStep;
writeInterval   500;
purgeWrite      2;
writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    wallShearStress
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        executeControl  writeTime;
        writeControl    writeTime;
        patches         (plate);
    }
    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        executeControl  writeTime;
        writeControl    writeTime;
        patches         (plate);
    }
    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (U p k omega);
        executeControl  timeStep;
        executeInterval 1;
    }
}

// ************************************************************************* //
