.planning/case_profiles/case_032_v65_flat_plate_2nd_witness_dicts/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;
nu              1.4612e-05;

// ************************************************************************* //
