.planning/case_profiles/case_032_v65_flat_plate_2nd_witness_dicts/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (45 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (45 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (45 0 0);
    }
    plate
    {
        type            noSlip;
    }
    top
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
