.planning/case_profiles/case_032_v65_flat_plate_2nd_witness_dicts/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet           { type zeroGradient; }
    outlet          { type fixedValue; value uniform 0; }
    plate           { type zeroGradient; }
    top             { type slip; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
