.planning/case_profiles/case_032_v65_flat_plate_2nd_witness_dicts/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0.01055;

boundaryField
{
    inlet           { type calculated; value uniform 0.01055; }
    outlet          { type calculated; value uniform 0.01055; }
    plate
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    top             { type slip; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
