.planning/case_profiles/case_032_v65_flat_plate_2nd_witness_dicts/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes      { default steadyState; }
gradSchemes     { default Gauss linear; }
divSchemes
{
    default                 none;
    div(phi,U)              bounded Gauss linearUpwind grad(U);
    div(phi,k)              bounded Gauss limitedLinear 1;
    div(phi,omega)          bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
wallDist        { method meshWave; }

// ************************************************************************* //
