.planning/case_profiles/case_032_v65_flat_plate_2nd_witness_dicts/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }
    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
    residualControl
    {
        p   1e-5;
        U   1e-5;
        k   1e-5;
        omega 1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p   0.3;
    }
    equations
    {
        U   0.7;
        k   0.7;
        omega 0.7;
    }
}

// ************************************************************************* //
